app/controllers/home_controller.rb

  def home
    @metapackges = Metapackage.find(:all,
      :select => "base_packages.*, avg(ratings.rating) AS rating",
      :joins => "LEFT JOIN ratings ON base_packages.id = ratings.rateable_id",
      :conditions => "ratings.rateable_type = 'BasePackage'",
      :group => "ratings.rateable_id HAVING COUNT(ratings.id) > 2",
      :order => "rating DESC",
      :limit => 5)
---
SELECT * FROM `ratings` WHERE (`ratings`.rateable_id = 55641 AND `ratings`.rateable_type = 'BasePackage')
SELECT base_packages.*, avg(ratings.rating) AS rating FROM `base_packages` LEFT JOIN ratings ON base_packages.id = ratings.rateable_id WHERE (ratings.rateable_type = 'BasePackage' AND ratings_count > 2) AND ( (`base_packages`.`type` = 'Metapackage' ) ) GROUP BY ratings.rateable_id ORDER BY rating DESC LIMIT 5
SELECT count(*) AS count_all FROM `ratings` WHERE (`ratings`.rateable_id = 55641 AND `ratings`.rateable_type = 'BasePackage')